//javascript თავდაპირველად იყო სკრიფტინგის ენა რადგან ის მუშაობდა მხოლოდ ბრაუზერში შემდეგ გახდა სრულფასოვანი
//პროგრამირების ენა და ის მუშაობს ახლა სერვერებზეც

//undefined ნიშნავს რომ ცვლადი შეიქმნა მაგრამ მნიშვნელობა არ მოიძებნა
//null ნიშნავს ცარიელს დეველოპერი მიზანმიმართულად ანიჭებს ცვლადს რომ ის ცარიელია

//lenghtარის კუთვნილება რომელიც გვეუბნება თუ რამდენი სიმბოლოა სთრინგში

let text = "hello world"
console.log(text.length)

let fruits="ვაშლი,მსხალი,ატამი"
console.log(fruits.length)

//touppercase არის ფუნქცია რომელსაც ტექსტში ყველა ასო გადაზავს დიდ shift ში

let num = "hello world" 
console.log(num.toUpperCase())