// window -ობიექტი არის ბრაუზერის გლობალური ობიექტი
// ჯავასკრიფტში ფუნქციას ვქმნით სამი გზით let,const,var
let age = 25
age = 26
//მისი ხელახლა გამოძახება ბლოკში არ შეგვიძლია მაგრამ შესაძლებელია ბლოკის გარეთ გამოძახება
const name = "giorgi"
//შექმნისთანავე უნდა მივცეთ მნიშვნელობა,მისი არც ხელახლა გამოძახება შეგვიძლია და არც მნიშვნელობის შეცვლა.
var name="nika"
var name="luka"
// ეს შეცდომას არ ამოაგდებს რაც ცუდია
// შეგვიძლია მისი ხელახლა გამოძახება და მნიშვნელობის შეცვლაც


// var-ით შექმნილი ცვლადები კოდის დასაწყისში იწევს რის გამოც შეგვიძლია მათ გამოცხადებამდე გამოვიძახოთ
//  და ერორის ნაცვლად მივიღებთ undefined-ს.
//var-ს არ ესმის ფიგურული ფრჩხილების  თუ ცვლადს if-ში 
// შექმნით var-ით ის გარეთაც ხელმისაწვდომი იქნება რაც ლოგიკას აფუჭებს.

//იმიტომ არ წაშალეს რომ var ით არის გაკეთებული ძალიან ბევრი ძველი საიტი და რომ წაეშალათ ზველა გატზდებოდა

//Increment ++ ზრდის ცვლადის მნიშვნელობას 1-ით
//Decrement -- ამცირებს ცვლადის მნიშვნელობას 1-ით
let score = 10;
score++;
console.log(score); // გამოიტანს 11-ს

let score = 51;
score--;
console.log(score); //გამოიტანს 50-ს


// string literal არის ტექსტის ჩაწერის თანამედროვე გზა ის იწერება $ ნიშნით.
//მაგ:
const my_age = 22
const centence = "i am ${my_age}years old";

console.log(centence)


let nugo_aris= true; 
console.log(typeof nugo_aris); 