//მონაცემთა ტიპები//
//string-ნებისმიერი ბრჭყალში დაწერილი ტექსტი("hello world")
//number-ნებისმიერი რიცხვი (24,56.3)
//boolean-შეიცავს მხოლოდ 2 მნიშვნელობას (true/false)
//undefined-ცვლადი რომელსაც აქვს სახელი მაგრამ არ აქვს მნიშვნელობა
//null-ცვლადი რომელსაც აქვს მნიშვნელობა მაგრამ არ აქვს სახელი
console.log(55*68);
console.log(10 + 12);  
console.log(178 - 4);   
console.log(40 / 10);  
console.log(100 % 5);  
console.log(10 ** 4); 
//console არის ინსტრუმენტი რომელიც გამოიყენება შეცდომების საპოვნელად ფა ინფორმაციის
//გამოსატანად.
console.log("hello world"+56);
console.log("პროგრამირება"+" "+"საინტერესოა");
console.log("ჩემი ასაკია: " + 17);